## EX03

In [2]:
import sqlite3
import pandas as pd

try:
    sqlite_connection = sqlite3.connect('data/checking-logs.sqlite.sqlite')
except sqlite3.Error as error:
    print("Ошибка при подключении к sqlite", error)
print('УСПЕШНО')

УСПЕШНО

In [3]:
request = 'PRAGMA table_info(checker);'
pd.io.sql.read_sql(request, sqlite_connection)

   cid       name       type  notnull dflt_value  pk
0    0      index    INTEGER        0       None   0
1    1     status       TEXT        0       None   0
2    2    success    INTEGER        0       None   0
3    3  timestamp  TIMESTAMP        0       None   0
4    4  numTrials    INTEGER        0       None   0
5    5    labname       TEXT        0       None   0
6    6        uid       TEXT        0       None   0

In [4]:
request = 'SELECT * FROM test;'
pd.io.sql.read_sql(request, sqlite_connection).head(10)

   index      uid               first_view_ts
0      3  user_17  2020-04-18 10:56:55.833899
1      4  user_30  2020-04-17 22:46:26.785035
2      7  user_30  2020-04-17 22:46:26.785035
3      8  user_14  2020-04-18 10:53:52.623447
4     11  user_14  2020-04-18 10:53:52.623447
5     18  user_19  2020-04-21 20:30:38.034966
6     19  user_25  2020-05-09 23:54:54.260791
7     20  user_21  2020-04-22 22:40:36.824081
8     21  user_30  2020-04-17 22:46:26.785035
9     23  user_21  2020-04-22 22:40:36.824081

In [5]:
request = 'SELECT * FROM deadlines;'
pd.io.sql.read_sql(request, sqlite_connection).head(10)

   index      labs   deadlines
0      0    laba04  1587945599
1      1   laba04s  1587945599
2      2    laba05  1588550399
3      4    laba06  1590364799
4      5   laba06s  1590364799
5      3  project1  1589673599

In [6]:
request = \
"""
SELECT test.uid FROM test


;
"""
res = pd.io.sql.read_sql(request, sqlite_connection)
res

         uid   labname            first_commit_ts              first_view_ts
0     user_4  project1 2020-04-17 05:19:02.744528                        NaT
1     user_4    laba04 2020-04-17 11:33:17.366400                        NaT
2     user_4   laba04s 2020-04-17 11:48:41.992466                        NaT
3    user_17  project1 2020-04-18 07:56:45.408648 2020-04-18 10:56:55.833899
4    user_30    laba04 2020-04-18 13:36:53.971502 2020-04-17 22:46:26.785035
..       ...       ...                        ...                        ...
135  user_23    laba06 2020-05-21 08:34:10.517205                        NaT
136  user_19   laba06s 2020-05-21 13:27:06.705881 2020-04-21 20:30:38.034966
137  user_23   laba06s 2020-05-21 14:29:15.709568                        NaT
138  user_17    laba06 2020-05-21 15:21:31.567615 2020-04-18 10:56:55.833899
139  user_17   laba06s 2020-05-21 17:39:17.783615 2020-04-18 10:56:55.833899

[140 rows x 4 columns]

In [ ]:
sqlite_connection.close()